---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.RegionPhaseMismatch
source: html/fed90ae9-3f3b-58fd-a956-fa2f0349be63.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.RegionPhaseMismatch Property

Subregions must have the same Phase Created parameter and Phase Demolished parameter as the host Toposurface. Subregion phase will be set to match the Toposurface.

## Syntax (C#)
```csharp
public static FailureDefinitionId RegionPhaseMismatch { get; }
```